/* const POSTs = [
    {
    title: "학원 알바 모집",
    contents: "ㅈㅎ시 에서 수학 학원 알바를 모집하고 있습니다! 수학과 우대! 일급 13000원! 하루 6시간 근무, 밥값 없음",
    },
    {
      title: "엄준식",
      contents: "어떠케 사람 이름이 엄준식",
    },
    {
      title: "님들 라면드시지마세요.txt",
      contents: "님들 라면드시지마세요 체질이라는게바뀝니다 예를들어 초식공룡과 육식공룡이잇는데요 초식공룡처럼힘약해질려면 라면을드시고 육식공룡처럼 힘쌔지고싶으시면 라면드시지마세요 합기도배운놈 따라하고 유도배운놈이겨서따라하고 복싱배운놈이겨서따라하고 잡종맛좀봐라 이얏 합기도+유도+복싱+태권도+ 아침밥 꼭먹고 학교가기ㅋㅋ아침밥머기전 물2잔ㅇㅋ10초간격으로 물1한마시고또물1한잔 20분후 식사ㄱㄱ밥먹을때 국잇어야됨 아침,점심,저녁 꼭 꼬박꼬박 챙겨드세요 군것질해봣자 몸무게만늘고 힘빠지고 식사후2시간동안 똥누면안됨 힘쌔질려멱 그리고 이온음료,탄산음료 는 목막힐때만 먹는거임 과자는 먹어봣짜 힘빠지고 아스크림 힘빠지고 초콜릿 힘빠지고 라면은 체질이바뀜 동물로비유하자면 초식동물과 육식동물이잇는데요 초식동물처럼 힘이약해지고 싶으면 라면을 먹어야되고 육식동물처럼 라면 안먹어야됨 힘쌔질려면학교급식에 사과나오면먹으면안되고 밥먹을때 국부터먹는거다 고기반찬나왓다고 고기부터먹는게아니라 다먹고 물컵에 물 80%ㅇ따는후 절반씩 천천히나눠서마셔라 그리고 힘쌔지고싶으면 킥복싱배워라 힘,체력,기술배울수잇고 와사바리를 전문으로가르켜주는게 유도체육관이다 요구르트 먹지말고 요플레 적당히먹어라 그리고 막창,곱창 조금만 먹어라 그리고고기를 많이먹지마라 그리고 라면먹지마라 체질이바뀌니까 그리고 이온음료,탄산음료는 적당히 만먹고 우유는 흰우유마시지마라 딸기우유마셔라 그리고 남.여 는 흰우유마시면힘빠진다 흰우유는 키클때미 도움이됩니다 그리고 힘쌔질려면 초코우유,바나나우유,딸기우유많이마시고 우유좋아하는사람만 그리고 딸기먹는거 좋아하는사람은 백설탕에 찍어먹어라 그리고 딸기많이먹고 치킨많이먹어라 최소1인1닭해라 닭 먹을때 이온음료,탄산음료 마시지말고 그리고 우유는 키크고싶은사람만먹어라 그리고 라면은 동물로비유하자면 초식동물과 육식동물이 잇는데 초식동물처럼 힘이약해지고싶으면 라면을먹어라 그리고 육식동물처럼 힘이쌔지고싶으면 라면먹지마라 그리고 자고로 남자는 등빨이잇어야되고 그리고 남자는 덩치가클려면 어깨,등을 넓게만들어야되고 라면먹지말아야된다 힘모조리빠진다 그리고 회는 많이먹어라 회 많이먹고 생선 많이먹고 그리고 운동은 요즘뜨는운동 킥복싱 또는가라데배워라 아니면 님꼴리는데로 배우삼 아니면 복싱+킥복싱+무에타이+레슬링+주짓수+크로스핏=격투기?다 배웟네....그리고 과자 이스크림 초콜릿 초코파이 먹지마라 힘빠진다 짠거는 적당히 먹어라 매운음식은너무 먹지마라 얼굴이화끈거려서 얼굴이커진다 그리고 단음식은 많이먹으면안좋다 그리고 술은 마시지마라 힘빠진다 소주는 힘안빠진다 맥주는 힘ㅈㄴ빠진다 맥주는 치킨3마리먹은게빠지는거다 치킨많이먹으면 힘쌔진다 그리고 치킨먹을때 맥주먹지마라 힘빠진다 치킨먹을때 맥주먹으면 힘ㅈㄴ빠지고 그리고 술마시지말고 술 좋아하는사람은 복싱,킥복싱,무에타이,레슬링,주짓수,가라데,유도,태권도,합기도,씨름,특공무술,헬스 많이배워라 그리고 운동많이하고 술은마시지마라 마셔봐야술배만나온다 그리고 야식은 운동은 저녁에만하고 운동한날은 야식먹지마라 그리고 야식은먹어봣자 배만나온다 그리고 야식먹을때 라면절대말고 치킨먹어라 라면먹고싶으면 치킨,족발,보쌈.닭발많이먹고 국물잇는음식만 먹어라 그리고 라면먹고싶으면 집에 비빔면이나 불닭 먹고싶으면 먹지마라 힘빠진다 그리고 짬뽕,우동 많이먹어라 그리고 면종류는먹으면 힘빠진다는이유가 면이전부다밀가루음식이라서 라면 밀가루 ㅇㅋ? 라면먹지마라 먹을때만좋다 힘 모조리빠진다 그리고 짜장면먹으면 힘쌔진다는이유가 짜장면먹을때 탕수육먹기때문이다 탕수욱 속안에 돼지고기가들어잇고 돼지고기에 튀긴걸 탕수육이라고한다 그래서 탕수육많이먹으라는거다 힘이쌔진다는거다 그리고 탕수육이랑깐풍기많이먹어라 그리고 짜장면,짬뽕 많이먹어라 그리고 짜장면먹을때 탕수육이랑 맨날같이먹고 탕수육이먼저나오면 탕수육부터먹고 짜장면부터나오면 탕수육나올때까지 기다리다가 짜장면 나온후 탕수육먹어야힘쌔진다 탕수육먹을때 소스에먼저 찍어먹지말고 찍지말고먹어라 그리고 탕수육은 찍어먹어라 부어먹지말고 부억보다 찍먹이더맛잇다 그리고 잡채밥 좋아하는사람은 잡채밥많이먹어라 그리고 야끼우동많이먹어라 맛있다 그리고 먹나가 목마르면 단무지먹고 목마르면 물,이온음료,탄산음료도 먹지말고 그리고 사람으로 태어낫으면 위아래는 가리고 예의잇게 최대한 행동하고 그리고 위아래는가봐면서 덤비고 그리고 아 그렇게된거엿네 막아줄사람들한테 아 그렇게된거엿네 저도 라면 먹지마라 그리고 고생끝에 낙이온다 오픈핑거글러브 끼고 손가락으로싸우는상대 눈찌르지마라 반칙이다 규칙은지켜라너를사랑해 현이지성루비준이재영지은 서든어택링컨클랜2040년까지 격투기20년가자나빼궁ㅋ 나늕스트리트파이터라서 헬스,체육관안다녀도싸움잘한다.그리고 격투기20년배우고 유도20년씩 배워놓으면 주먹으로치고박다가 업어치기 가능하니까 싸울때 주먹으로치고박다가 가까이붙으면 레슬링기술써도됨그리고 유도기술써도됨 업어치기ㄱㄱ유도7년이상배우고 격투기10년이상배우면 주먹으로치고박다가 업어치기가 가능함 그리고 태권도는 뒤돌려차기하면 한쪽다리뜨니까 로우킥차거나 아니면 태클드가면바로 테이크다운성공임 음식은 라면먹지말고 체질이바뀌니까 고기많이먹고 탄산음료마시지말고 이온음료마시고 과자먹지말고 아스크림먹지말고초콜릿먹지말고 손가락에뼈소리나는거하지마라 힘빠진다 ㅅㄱ딸기배걸탕에찍어먹으면맛남 그리고 사과,자두,배,포도 다힘빠짐 과일좋아하는사람은 딸기 백설탕에찍어드삼 주먹이쌔짐너를사랑해 현이지성루비준이재영지은 서든어택링컨클랜2040년까지 격투기0년가자너를사랑해 현이지성루비준이재영지은 서든어택링컨클랜2040년까지 격투기2년가자너를사랑해 현이지성루비준이재영지은 서든어택링컨클랜2040년까지 격투기2년가자나빼궁ㅋ너를사랑해 현이지성루비준이재영지은 서든어택링컨클랜2040년까지 격투기20년가자나빼궁ㅋ매일감사해눈물이난이유안친해질려는사람 굳이인생망한거밖엔더되나?ㅋ 다 인생망하자고친해실려고햇나치킨만 많이먹어도힘쌔지고치킨무만먹어야되고 라면절대먹으면안됨 체질이바뀜 그리고 라면은먹을따만좋고 먹고난후 진짜 죽을만큼후회가될정도로힘이빠지는음식임 라면절때먹으면안됨 그리고 식단은이만하면됏고 운동이중요함 최소격투기10년 유도10년배우는게좋아 합쳐서 20년치킨매상올리거라 주먹쌔진다 치킨무만먹자치킨먹을때만친구들아정태수 싸움스타일 주먹으로치고박다가 업어치기 싸움이시작되기전 니가우리애를건드려서 닌좀밎아야겟다라고 멋진 멘트를따날리고 주먹으로얼굴을치는스타일 정태수랑싸울려면 라면절대먹으면안되고 고기많이먹어야디고 치킨많이먹어야 길에서싸울때 많은도움이된다 그리고 손이랑발에뼈소리나면주먹이약해진다 그리고 치킨먹을때 치킨무빼고아무것도먹으면안된다 치킨먹을때 밥먹으면 힘빠지고 탄산음료도힘빠지고 이온음료도힘빠지고 물도힘빠진다 치킨먹을때는 치킨무만먹어야 힘쌔지고 치킨무물을먹으면안된다 그리고 다먹고20분동안 앉아잇다가일어나야되고 주먹이쌔진다 주먹이쌔질려면 치킨1인1닭해야되고 최소1한달에 치킨60~70마리이상먹으면힘쌔진다 그리고 치킨먹을때60~70번먹을때 1~3번 이라도 밥이나 탄산음료,이온으료먹으면주먹약해진다 그리그 치킨먹을때100번을먹던200번을먹던주먹이강해질려면 치키을많이먹어야되고 치킨먹을때 치킨무만먹어야되고치킨무물을먹으면안된다 그리고 이온음료,탄산음료마시면 힘다빠진다 치킨먹을때 이온음료,탄산음료 치킨1한달동안 60마리시켜먹은거 힘다빠지는거다 그리고 치킨먹을때 절대 화장실가서 똥누면힘다빠진다 그리고 치킨먹을때목마를때만 치킨무먹는거다 목마르면 음료수나물을마시는것보다 치킨무먹어라 그렇게해야힘쌔진다 그리고 치킨다먹고 손에 뼈소리나는거하지마라 주먹은약해지고 몸만뚱뚱해지는거다 그리고 주먹이엄청약해진다 혹시 대구박00형 아냐? 대구주먹임 정태수형님과의싸움에서 유도기술로졋음 유도7년 격투기13년 정태수찜많이드세요 닭갈비찜많으드시면 힘쌔집니다손실제로보면만굶음ㅋ그리고 손굶어질라믄 골고루먹고손시랑발에뼈소리많이나면손발커지고손목발목굶어짐태권도는 발차기만배우잔슴 격투기는 주먹,발차기,태클,풀마운트,파운딩 유도,업어치기,후리기,조르기,굳히기,꺽기,누르기 배움 유도지랫대의원리를사용하여 상대방의힘을 역이용하여넘기는운동 유도의전설 김재범,이원히,왕기춘 등등 ㄱㄱ요즘 세상이험하다보니까 격투기랑,유도배워서 호신용으로 5년이상배워두세요 손해보는거없습니다 꼭 배우세요 그리고 힘쌔지고싶으면 고기,국,찌개 많이먹고 채소,음료수는적당히먹는게좋고 무슨음식이든간에먹고 물한잔컵에따른후 절반씩 천천히마시고 남은절반마시고나서 1분동안 앉아잇다가일어나야힘이쌔짐 그리고 요즘세상이험하니까 절때 혼자길에돌아다니지마세요 요즘 밤에 혼자돌아다니면 위험합니다 꼭 호신용으로 격투기,유도 꼭배우시고 단증딸정도로오래배우시고 위험한일잇으면 꼭 운동배워서 호신술 꼭쓰세요 "
    },
    {
      title: "세차 초2222보를 위한 디테일링 가이드! (프리워시편)",
      contents: "오늘은 셀프세차, 그리고 디테일링에서 가장 첫번째 과정에 해당하는 프리워시(Pre-Wash)에 대해서 알아보겠습니다.                     '프리워시란' 이란                     프리워시는 본세차에 들어가기 전에 차량에 붙어있는 굵은 오염물질을 제거해서 본세차시 발생할 수 있는 스크레치, 잔기스 그리고 스월마크를 방지해주는 과정입니다.                     프리워시 단계에서는 고압세척기, 프리워시 약제 그리고 스노우폼 세차 등을 이용하여 진행하게 되는 디테일링의 수많은 단계 중에서 가장 첫번째 단계입니다.                      '고압수'                     고압수는 수압이 매우 강해서 고압수만으로도 어느 정도 굵은 오염물질을 제거할 수 있습니다. 일반적으로 고압세척기의 압력이 100bar 이상이면 자동차 세차를 하기에 충분한 압력입니다.                     가정용으로 나오는 고압세척기나 셀프세차장에서 사용하는 압력이 보통 100~110bar 정도입니다. 아래는 셀프세차장, 손세차장에서 사용 중인 일반적인 고압세척기 압력입니다. 참고하시기 바랍니다.",
    },
    {
      title: "독일 고양이",
      contents: "이 편지는 영국에서 최초로 시작되어 일년에 한바퀴를 돌면서 받는 사람에게 행운을 주었고 지금은 당신에게로 옮겨진 이 편지는 4일 안에 당신 곁을 떠나야 합니다. 이 편지를 포함해서 7통을 행운이 필요한 사람에게 보내 주셔야 합니다. 복사를 해도 좋습니다. 혹 미신이라 하실지 모르지만 사실입니다. 영국에서 HGXWCH이라는 사람은 1930년에 이 편지를 받았습니다. 그는 비서에게 복사해서 보내라고 했습니다. 며칠 뒤에 복권이 당첨되어 20억을 받았습니다. 어떤 이는 이 편지를 받았으나 96시간 이내 자신의 손에서 떠나야 한다는 사실을 잊었습니다. 그는 곧 사직되었습니다. 나중에야 이 사실을 알고 7통의 편지를 보냈는데 다시 좋은 직장을 얻었습니다. 미국의 케네디 대통령은 이 편지를 받았지만 그냥 버렸습니다. 결국 9일 후 그는 암살당했습니다. 기억해 주세요. 이 편지를 보내면 7년의 행운이 있을 것이고 그렇지 않으면 3년의 불행이 있을 것입니다. 그리고 이 편지를 버리거나 낙서를 해서는 절대로 안됩니다. 7통입니다. 이 편지를 받은 사람은 행운이 깃들것입니다. 힘들겠지만 좋은게 좋다고 생각하세요. 7년의 행운을 빌면서...",
    },
    {
      title: "미국 증시와 한국 증시의 조정 그리고 바이든의 방한",
      contents: "첫 번째 미국의 인플레이션은 뭄ㄴ제는 양적완화를 통한 후폭풍으로 해석할 수 있으나, 국제 유가의 고공행진, 러-우 전쟁등의 이슈로 불러온 영향력도 크다.",
    }
  ];
 */

  /*   const bid = document.location.pathname.split('/')[3];
  fetch(`/post/${bid}`)
  .then(res => res.json())
  .then(myJson => {
      const post_title = postboxClone.querySelector('#post_title'); 
      const post_contents =  postboxClone.querySelector('#post_contents');
      
      post_title.textContent = myJson.post_title;
      post_contents.textContent = myJson.post_contents;
    });
 */

  

    var xhr = new XMLHttpRequest();
xhr.open('GET', '/post', true);
xhr.onload = function() {
  if (xhr.status === 200) {
    var postData = JSON.parse(xhr.responseText);
    document.getElementById('post_title').innerHTML = postData.post_title;
    document.getElementById('post_contents').innerHTML = postData.post_content;
  } else {
    console.error('Error occurred while fetching data:', xhr.status);
  }
};
xhr.send();




  /* 
    // postbox 틀 가저옴
  const postbox = document.getElementById('postbox_in');
  
  for (let i = 0; i < POSTs.length; i++) {
    // postbox를 복제 후  제목과 내용 넣을 변수 생성
    const postboxClone = postbox.cloneNode(true);
  
    // 제목과 내용 추가하는 알고리즘
    const postTitle = POSTs[i].title;
    const postContents = POSTs[i].contents;
    postboxClone.querySelector('#post_title').textContent = postTitle;
    postboxClone.querySelector('#post_contents').textContent = postContents;
  
    // 내용 과 틀 복사
    document.body.appendChild(postboxClone);
  }
  
  // 첫번 째 포스트 박스 삭제
  postbox.remove();
  
  */

  


